{
  "backend/main.mo": "Motoko actor defining user profiles, trade analysis types, access control, and CRUD-style queries for profiles and analyses.",
  "feature_evidence.json": "Feature-to-file mapping describing implemented frontend features, components, and confidence metadata.",
  "frontend-file-summaries.txt": "Reference list of concise summaries for many frontend files, used as build documentation.",
  "frontend/index.css": "Tailwind base/theme configuration defining light and dark mode CSS variables and global styles.",
  "frontend/index.html": "HTML entry point bootstrapping the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component setting up theming and rendering AppShell with AnalysisDashboard.",
  "frontend/src/components/asset/AssetPicker.tsx": "Radio-based picker letting users choose between EUR/USD OTC and USD/JPY OTC assets.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with React Query cache reset.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter and save their profile name.",
  "frontend/src/components/confluence/ConfluenceDashboard.tsx": "UI dashboard showing multi-timeframe confluence signals, confidence, and aligned state indicators.",
  "frontend/src/components/history/AnalysisHistoryPanel.tsx": "Displays a scrollable list of past analysis sessions with timestamps, asset info, signal badges, and a button to view details.",
  "frontend/src/components/history/OutcomeControls.tsx": "Provides controls to mark whether a trade was taken and set its outcome as win, loss, or unknown, showing a status badge.",
  "frontend/src/components/layout/AppShell.tsx": "Wraps the app with layout structure including header, footer, authentication display, and background styling.",
  "frontend/src/components/review/ReviewConfirmPanel.tsx": "Allows users to review and edit extracted analysis features, showing warnings for low-confidence or missing values before confirmation.",
  "frontend/src/components/risk/RiskPanel.tsx": "Shows account risk settings and calculated metrics such as recommended stake, daily loss, trades remaining, and stop-loss alerts.",
  "frontend/src/components/signal/SignalResultCard.tsx": "Displays the generated trading signal with icon, confidence, rationale list, and contributing strategy badges.",
  "frontend/src/components/stats/PerformanceStatsPanel.tsx": "Presents performance metrics like total trades, wins, losses, win rate, and streaks with conditional highlights.",
  "frontend/src/components/timer/CandleTimer.tsx": "Shows a countdown timer to the next candle, optional sound alert, and a progress bar synced to real-time seconds.",
  "frontend/src/components/upload/ScreenshotUploadCard.tsx": "React component for uploading, previewing, validating, clearing, and submitting image screenshots.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, logout, and identity persistence with AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks wrapping backend calls for user profiles and trade analyses, including save/store mutations.",
  "frontend/src/index.css": "Tailwind base setup defining CSS variables for themes and applying global background and border styles.",
  "frontend/src/lib/confluence/confluenceEngine.ts": "Computes multi-timeframe confluence by generating signals for S30, M1, and M5 and determining overall alignment.",
  "frontend/src/lib/engine/combinedSignalEngine.ts": "Generates trading signals by combining momentum and trap-wick strategies with confidence checks and filters.",
  "frontend/src/lib/risk/riskCalculator.ts": "Calculates risk metrics including per-trade risk, daily losses, stop-loss status, and remaining trades based on sessions.",
  "frontend/src/lib/stats/performanceStats.ts": "Computes win/loss stats, not-taken count, win rate, and streaks from analysis sessions.",
  "frontend/src/lib/vision/extractFromScreenshot.ts": "Mocks async screenshot feature extraction and returns predefined indicator and candle data.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AnalysisDashboard.tsx": "Main dashboard managing screenshot upload, feature extraction, signal generation, history, and UI flow.",
  "frontend/src/state/historyStore.ts": "Zustand store persisting and managing up to 20 recent analysis sessions.",
  "frontend/src/state/settingsStore.ts": "Zustand store persisting user settings like balance, stop loss, and sound preferences.",
  "frontend/src/types/analysis.ts": "Defines types for extracted features, signals, confluence, and analysis sessions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for retrieving, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, fonts, animations, and plugins.",
  "project_state.json": "Metadata describing project state, features, requirements, and image assets."
}